Repository: UKGovernmentBEIS/beis-simple-energy-advice-beta
Catalog: SeaPublicWebsite/Resources/SharedResources.*.resx
Languages: cy

source: If you typed the web address, check it is correct.
cy: Os oeddech chi wedi teipio’r cyfeiriad gwe, gwnewch yn siŵr ei fod yn gywir.

source: If you pasted the web address, check you copied the entire address.
cy: Os oeddech chi wedi gludo’r cyfeiriad gwe, gwnewch yn siŵr eich bod wedi copïo’r cyfeiriad cyfan.

source: If the web address is correct or you selected a link or button, contact our digital support assistants if you need to speak to someone.
cy: Os yw’r cyfeiriad gwe yn gywir neu os oeddech chi wedi dewis dolen neu fotwm, cysylltwch â’n cynorthwywyr cymorth digidol os hoffech chi siarad â rhywun.

source: Opening times:
cy: Amseroedd agor:

source: Invalid reference
cy: Cyfeirnod annilys

source: Sorry, there is a problem with the service
cy: Yn anffodus, mae problem â’r gwasanaeth

source: Try again later.
cy: Rhowch gynnig arall arni yn nes ymlaen.

source: We have not saved your answers. When the service is available, you will have to start again.
cy: Dydyn ni ddim wedi cadw eich atebion. Pan fydd y gwasanaeth ar gael, bydd yn rhaid i chi ddechrau eto.

source: Health Check Passed
cy: Wedi Pasio’r Prawf Iechyd

source: We use some essential cookies to make this service work.
cy: Rydyn ni’n defnyddio rhai cwcis hanfodol i wneud i’r gwasanaeth hwn weithio.

source: We'd also like to use analytics cookies so we can understand how you use the service and make improvements.
cy: Bydden ni hefyd yn hoffi defnyddio cwcis dadansoddi er mwyn deall sut rydych chi’n defnyddio’r gwasanaeth ac yna gwella’r gwasanaeth.

source: Accept analytics cookies
cy: Derbyn cwcis dadansoddi

source: Reject analytics cookies
cy: Gwrthod cwcis dadansoddi

source: View cookies
cy: Gweld y cwcis

source: Hide cookie message
cy: Cuddio’r neges cwcis

source: This statement applies to content published on our service.
cy: Mae’r datganiad hwn yn berthnasol i gynnwys a gyhoeddir ar ein gwasanaeth.

source: This website is run by the Department for Business, Energy and Industrial Strategy (BEIS). We want as many people as possible to be able to use this website. For example, that means you should be able to:
cy: Mae’r wefan hon yn cael ei rhedeg gan yr Adran Busnes, Ynni a Strategaeth Ddiwydiannol (BEIS). Rydyn ni eisiau i gymaint o bobl ag sy’n bosib allu defnyddio'r wefan hon. Er enghraifft, mae hynny’n golygu y dylech chi allu:

source: change colours, contrast levels and fonts
cy: newid lliwiau, lefelau cyferbyniad a ffontiau

source: zoom in up to 200% without the text spilling off the screen
cy: chwyddo i mewn hyd at 200% a bod y testun i gyd yn dal i ffitio ar y sgrin

source: navigate most of the website using just a keyboard
cy: symud o gwmpas y rhan fwyaf o'r wefan gan ddefnyddio bysellfwrdd yn unig

source: navigate most of the website using speech recognition software
cy: symud o gwmpas y rhan fwyaf o'r wefan gan ddefnyddio meddalwedd adnabod llais

source: listen to most of the website using a screen reader (including the most recent versions of JAWS, NVDA and VoiceOver)
cy: gwrando ar y rhan fwyaf o'r wefan gan ddefnyddio darllenydd sgrin (gan gynnwys y fersiynau mwyaf diweddar o JAWS, NVDA a VoiceOver)

source: We’ve also made the website text as simple as possible to understand.
cy: Rydyn ni hefyd wedi gwneud testun y wefan mor syml, ac mor hawdd i’w ddeall ag sy’n bosib.

source: Reporting accessibility problems with this website
cy: Rhoi gwybod am broblemau hygyrchedd yn ymwneud â'r wefan hon

source: Enforcement procedure
cy: Gweithdrefn gorfodi

source: Technical information about this website’s accessibility
cy: Gwybodaeth dechnegol am hygyrchedd y wefan hon

source: The Department for Business, Energy and Industrial Strategy (BEIS) is committed to making its website accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018.
cy: Mae’r Adran Busnes, Ynni a Strategaeth Ddiwydiannol (BEIS) wedi ymrwymo i wneud ei gwefan yn hygyrch, yn unol â Rheoliadau Hygyrchedd Cyrff Sector Cyhoeddus (Gwefannau ac Apiau Symudol) (Rhif 2) 2018.

source: Compliance status
cy: Statws Cydymffurfio

source: Content that’s not within the scope of the accessibility regulations
cy: Cynnwys nad yw o fewn cwmpas y rheoliadau hygyrchedd

source: Not applicable.
cy: Ddim yn berthnasol.

source: What we’re doing to improve accessibility
cy: Beth rydyn ni’n ei wneud i wella hygyrchedd

source: We will fix issues that fail to meet the Web Content Accessibility Guidelines version 2.1 AA standard. We will update this page when issues are fixed.
cy: Byddwn yn datrys problemau nad ydynt yn cydymffurfio â safon AA Canllawiau Hygyrchedd Cynnwys y We fersiwn 2.1. Byddwn yn diweddaru’r dudalen hon pan fydd problemau wedi cael eu datrys.

source: Preparation of this accessibility statement
cy: Paratoi’r datganiad hygyrchedd hwn

source: This statement was prepared on 16 June 2022. It was last reviewed on 16 June 2022.
cy: Paratowyd y datganiad hwn ar 16 Mehefin 2022. Cafodd ei adolygu ddiwethaf ar 16 Mehefin 2022.

source: This website was last tested on 16 June 2022. The test was carried out by a Digital Accessibility Expert.
cy: Cafodd y wefan hon ei phrofi ddiwethaf ar 16 Mehefin 2022. Cynhaliwyd y prawf gan Arbenigwr Hygyrchedd Digidol.

source: Privacy notice
cy: Hysbysiad preifatrwydd

source: This notice sets out how we will use your personal data, and your rights. It is made under Articles 13 and/or 14 of the UK General Data Protection Regulation (UK GDPR).
cy: Mae’r rhybudd hwn yn nodi sut byddwn yn defnyddio eich data personol, a’ch hawliau. Fe’i gwneir o dan Erthygl 13 a/neu 14 o Reoliad Cyffredinol y DU ar Ddiogelu Data (GDPR).

source: Your data
cy: Eich data

source: This service does not automatically collect or store any personal data about you.
cy: Nid yw’r gwasanaeth hwn yn casglu nac yn storio data personol amdanoch chi yn awtomatig.

source: We may process the following personal data:
cy: Efallai y byddwn yn prosesu’r data personol canlynol:

source: Your name, email address and any other information sent directly to us via our email feedback function.
cy: Eich enw, cyfeiriad e-bost ac unrhyw wybodaeth arall a anfonir yn uniongyrchol atom drwy ein swyddogaeth adborth e-bost.

source: Purpose
cy: Pwrpas

source: We are processing your personal data in order to receive feedback about this service and to contact you for clarifications or to report service updates.
cy: Rydym yn prosesu eich data personol er mwyn cael adborth am y gwasanaeth hwn ac i gysylltu â chi am eglurhad neu i roi gwybod am ddiweddariadau i’r gwasanaeth.

source: Legal basis of processing
cy: Sail gyfreithiol dros brosesu

source: Recipients
cy: Derbynwyr

source: Your personal data will be shared by us with other Government Departments or public authorities where necessary. We may share your data if we are required to do so by law, for example by court order or to prevent fraud or other crime.
cy: Byddwn yn rhannu eich data personol gydag Adrannau eraill y Llywodraeth neu awdurdodau cyhoeddus lle bo angen. Efallai y byddwn yn rhannu eich data os bydd yn ofynnol i ni wneud hynny yn ôl y gyfraith, er enghraifft drwy orchymyn llys neu i atal twyll neu drosedd arall.

source: Your personal data may also be shared with the Softwire Technology Ltd who developed and help to maintain this service.
cy: Efallai y bydd eich data personol hefyd yn cael ei rannu â Softwire Technology Ltd a ddatblygodd y gwasanaeth hwn ac sy’n helpu i’w gynnal.

source: Retention
cy: Cadw data

source: Your personal details will be kept for a period of up to six months following the date of your final email sharing the details with us.
cy: Bydd eich manylion personol yn cael eu cadw gennym am hyd at chwe mis ar ôl dyddiad eich e-bost olaf yn rhannu’r manylion â ni.

source: Automated decision making
cy: Gwneud penderfyniadau awtomatig

source: Your personal data will not be subject to automated decision making.
cy: Ni fydd eich data personol yn destun penderfyniadau awtomatig.

source: Your Rights
cy: Eich Hawliau

source: You have the right to request information about how your personal data are processed, and to request a copy of that personal data.
cy: Mae gennych hawl i ofyn am wybodaeth ynghylch sut mae eich data personol yn cael ei brosesu, a gofyn am gopi o’r data personol hwnnw.

source: You have the right to request that any inaccuracies in your personal data are rectified without delay.
cy: Mae gennych hawl i ofyn i ni gywiro unrhyw wallau yn eich data personol yn ddi-oed.

source: You have the right to request that any incomplete personal data are completed, including by means of a supplementary statement.
cy: Mae gennych hawl i ofyn i ni gwblhau unrhyw ddata personol anghyflawn, gan gynnwys drwy ddatganiad atodol.

source: You have the right to request that your personal data are erased if there is no longer a justification for them to be processed.
cy: Mae gennych hawl i ofyn i’ch data personol gael eu dileu lle nad oes cyfiawnhad iddynt gael eu prosesu mwyach.

source: You have the right in certain circumstances (for example, where accuracy is contested) to request that the processing of your personal data is restricted.
cy: Mae gennych hawl mewn rhai amgylchiadau (er enghraifft, pan fydd amheuaeth ynghylch cywirdeb) i ofyn am gyfyngu ar brosesu eich data personol.

source: You have the right to object to the processing of your personal data where it is processed for direct marketing purposes.
cy: Mae gennych hawl i wrthwynebu i ni brosesu eich data personol lle bydd yn cael ei brosesu at ddibenion marchnata uniongyrchol.

source: You have the right to object to the processing of your personal data.
cy: Mae gennych hawl i wrthwynebu i ni brosesu eich data personol.

source: International Transfers
cy: Trosglwyddiadau Rhyngwladol

source: Complaints
cy: Cwynion

source: If you consider that your personal data has been misused or mishandled, you may make a complaint to the Information Commissioner, who is an independent regulator.
cy: Os ydych chi’n credu bod eich data personol wedi cael ei gamddefnyddio neu ei gamdrafod, gallwch chi gwyno wrth y Comisiynydd Gwybodaeth, sy’n rheoleiddiwr annibynnol.

source: The Information Commissioner can be contacted at:
cy: Gallwch gysylltu â’r Comisiynydd Gwybodaeth yn y cyfeiriad isod:

source: Information Commissioner's Office
cy: Swyddfa'r Comisiynydd Gwybodaeth

source: Cheshire
cy: Swydd Gaer

source: Telephone: 0303 123 1113
cy: Rhif ffôn: 0303 123 1113

source: Monday to Friday, 9am to 5pm (except public holidays)
cy: Dydd Llun i ddydd Gwener, 9am tan 5pm (ac eithrio gwyliau cyhoeddus)

source: Any complaint to the Information Commissioner is without prejudice to your right to seek redress through the courts.
cy: Ni fydd unrhyw gŵyn i’r Comisiynydd Gwybodaeth yn rhagfarnu ar eich hawl i geisio gwneud yn iawn drwy’r llysoedd.

source: Contact Details
cy: Manylion Cyswllt

source: You can contact the BEIS Data Protection Officer at:
cy: Gallwch gysylltu â Swyddog Diogelu Data BEIS yn:

source: BEIS Data Protection Officer,
cy: Swyddog Diogelu Data BEIS,

source: Department for Business, Energy and Industrial Strategy,
cy: Yr Adran Busnes, Ynni a Strategaeth Ddiwydiannol,

source: London SW1H 0ET
cy: Llundain SW1H 0ET

source: Email: dataprotection@beis.gov.uk
cy: E-bost: dataprotection@beis.gov.uk

source: Enter a building number or name
cy: Rhowch rif neu enw'r adeilad

source: Enter a postcode
cy: Rhowch y cod post

source: Select bungalow type
cy: Dewiswch y math o fyngalo

source: Select if your cavity walls are insulated
cy: Dewiswch a ydy eich waliau ceudod wedi’u hinswleiddio

source: Select your address
cy: Dewiswch eich cyfeiriad

source: My address is not listed here
cy: Nid yw fy nghyfeiriad wedi'i restru yma

source: Confirm whether or not this certificate belongs to your address before continuing
cy: Cadarnhewch a yw'r dystysgrif hon yn perthyn i'ch cyfeiriad chi cyn bwrw ymlaen

source: Select which country the property is located in
cy: Dewiswch ym mha wlad mae’r eiddo

source: Confirm whether or not you would like to search for your EPC before continuing
cy: Cadarnhewch a hoffech chi chwilio am eich EPC cyn bwrw ymlaen

source: Select flat type
cy: Dewiswch y math o fflat

source: Select how your floor is built
cy: Dewiswch sut mae eich llawr wedi’i adeiladu

source: Select if the floor is insulated
cy: Dewiswch a yw’r llawr wedi’i inswleiddio

source: Select glazing type
cy: Dewiswch y math o ffenestri

source: Select heating pattern
cy: Dewiswch y patrwm gwresogi

source: Number of hours in the morning
cy: Nifer yr oriau yn y bore

source: Enter number of hours in the morning
cy: Rhowch nifer yr oriau yn y bore

source: Number of hours
cy: Nifer yr oriau

source: Number of hours in the afternoon and evening
cy: Nifer yr oriau yn y prynhawn a gyda’r nos

source: Enter number of hours in the afternoon and evening
cy: Rhowch nifer yr oriau yn y prynhawn a gyda’r nos

source: Select your main heating system
cy: Dewiswch eich prif system wresogi

source: Select what year your property was built
cy: Dewiswch ym mha flwyddyn y cafodd eich eiddo ei adeiladu

source: Select whether you have a hot water cylinder
cy: Dewiswch a oes gennych chi danc dŵr poeth

source: Select house type
cy: Dewiswch y math o dŷ

source: Select if you have loft access
cy: Dewiswch a oes gennych chi fynediad i’r atig

source: Select if you have a loft space
cy: Dewiswch a oes gennych chi le gwag yn y to

source: Select if you have used this service before
cy: Dewiswch a ydych chi wedi defnyddio’r gwasanaeth hwn o'r blaen

source: Enter your 8-character reference code (or choose the 'This is my first visit' option)
cy: Rhowch eich cyfeirnod 8 nod (neu dewiswch yr opsiwn 'Dyma fy ymweliad cyntaf')

source: Enter a valid email address
cy: Rhowch gyfeiriad e-bost dilys

source: The number of people who live in the property
cy: Nifer y bobl sy’n byw yn yr eiddo

source: Enter the number of people who live in the property
cy: Rhowch nifer y bobl sy'n byw yn yr eiddo

source: Select whether you have outdoor space
cy: Dewiswch a oes gennych chi le y tu allan

source: Select your circumstances
cy: Dewiswch eich amgylchiadau

source: Select property type
cy: Dewiswch y math o eiddo

source: Select what to do with this recommendation
cy: Dewiswch beth i'w wneud gyda'r argymhelliad hwn

source: Select roof type
cy: Dewiswch y math o do

source: Select if the roof is insulated
cy: Dewiswch a yw’r to wedi’i inswleiddio

source: Select if your solid walls are insulated
cy: Dewiswch a yw eich waliau solet wedi’u hinswleiddio

source: Enter a number between 5 and 35, or skip this question
cy: Rhowch rif rhwng 5 a 35, neu anwybyddwch y cwestiwn hwn

source: The temperature
cy: Y tymheredd

source: Select wall type
cy: Dewiswch y math o wal

source: Your answers
cy: Eich atebion

source: Enter your address
cy: Rhoi eich cyfeiriad

source: Bungalow type
cy: Math o fyngalo

source: Cavity Walls Insulated
cy: Waliau Ceudod wedi’u Hinswleiddio

source: Check your unchangeable answers
cy: Gwirio eich atebion nad oes modd eu newid

source: Confirm your address
cy: Cadarnhau eich cyfeiriad

source: Country
cy: Gwlad

source: Flat type
cy: Math o fflat

source: Floor Construction
cy: Adeiladwaith y lloriau

source: Floor Insulated
cy: Llawr wedi’i Inswleiddio

source: Glazing Type
cy: Math o Ffenestri

source: Heating pattern
cy: Patrwm gwresogi

source: Heating Type
cy: Math o system wresogi

source: Property age
cy: Oed yr eiddo

source: Hot water cylinder
cy: Tanc dŵr poeth

source: House type
cy: Math o dŷ

source: Energy Efficiency Questionnaire
cy: Holiadur Effeithlonrwydd Ynni

source: Loft access
cy: Mynediad i’r atig

source: Loft space
cy: Lle gwag yn y to

source: New or returning user
cy: Defnyddiwr newydd neu ddefnyddiwr sy’n dychwelyd

source: No EPC found
cy: Heb ddod o hyd i EPC

source: Number of occupants
cy: Nifer y preswylwyr

source: Other Heating Type
cy: Math arall o system wresogi

source: Outdoor space for heat pump
cy: Man y tu allan ar gyfer pwmp gwres

source: Ownership status
cy: Statws perchnogaeth

source: Property type
cy: Math o eiddo

source: Roof Construction
cy: Adeiladwaith y to

source: Roof Insulated
cy: To wedi’i Inswleiddio

source: Only available to homeowners in England and Wales
cy: Dim ond ar gael i berchnogion tai yng Nghymru a Lloegr

source: Solid Walls Insulated
cy: Waliau Solet wedi’u Hinswleiddio

source: Wall Construction
cy: Adeiladwaith y waliau

source: Your recommendations
cy: Eich argymhellion

source: Page not found - Home Energy Retrofit Advice - GOV.UK
cy: Heb ganfod y dudalen - Cyngor ar Ôl-osod Ynni Cartref - GOV.UK

source: Sorry, there is a problem with the service - Home Energy Retrofit Advice - GOV.UK
cy: Yn anffodus, mae problem â’r gwasanaeth - Cyngor ar Ôl-osod Ynni Cartref - GOV.UK

source: Accessibility statement on Find energy improvements suitable for your home
cy: Datganiad hygyrchedd ar Dod o hyd i welliannau ynni sy’n addas ar gyfer eich cartref

source: DontKnow = 0,
cy: DdimYnGwybod = 0,

source: SuspendedFloorWithoutInsulation = 1,
cy: LlawrCrogHebDdeunyddInswleiddio = 1,

source: SuspendedFloorWithInsulation = 2,
cy: LlawrCrogGydaDeunyddInswleiddio = 2,

source: SolidFloorWithInsulation = 3,
cy: LlawrSoletGydaDeunyddInswleiddio = 3,

source: SolidFloorWithoutInsulation = 4,
cy: LlawrSoletHebDdeunyddInswleiddio = 4,

source: AllDayAndAllNight = 1,
cy: Drwy’rDyddANos = 1,

source: GasBoiler,
cy: BoelerNwy,

source: OilBoiler,
cy: BoelerOlew,

source: LpgBoiler,
cy: BoelerLPG,

source: Storage,
cy: Stôr,

source: DirectActionElectric,
cy: TrydanUniongyrchol,

source: HeatPump,
cy: PwmpGwres,

source: Other,
cy: Arall,

source: DoNotKnow,
cy: DdimYnGwybod,

source: Biomass,
cy: Biomas,

source: CoalOrSolidFuel,
cy: GloNeuDanwyddSolet,

source: I don’t know
cy: Ddim yn gwybod

source: Before 1900
cy: Cyn 1900

source: 1900 to 1929
cy: 1900 i 1929

source: Start,
cy: Dechrau,

source: NewOrReturningUser,
cy: DefnyddiwrNewyddNeuDdefnyddiwrSy’nDychwelyd,

source: Country,
cy: Gwlad,

source: OwnershipStatus,
cy: StatwsPerchnogaeth,

source: ServiceUnsuitable,
cy: GwasanaethAnaddas,

source: FindEpc,
cy: CanfodEPC,

source: AskForPostcode,
cy: GofynAmGodPost,

source: ConfirmAddress,
cy: CadarnhauCyfeiriad,

source: ConfirmEpcDetails,
cy: CadarnhauManylionEPC,

source: NoEpcFound,
cy: HebGanfodEPC,

source: PropertyType,
cy: MathEiddo,

source: HouseType,
cy: MathTŷ,

source: BungalowType,
cy: MathByngalo,

source: FlatType,
cy: MathFflat,

source: HomeAge,
cy: OedCatref,

source: CheckYourUnchangeableAnswers,
cy: GwirioEichAtebionNaEllirEuNewid,

source: WallConstruction,
cy: AdeiladwaithWaliau,

source: CavityWallsInsulated,
cy: WaliauCeudodWedi'uInswleiddio,

source: SolidWallsInsulated,
cy: WaliauSoletWedi’uInswleiddio,

source: FloorConstruction,
cy: AdeiladwaithLloriau,

source: FloorInsulated,
cy: LlawrWedi’iInswleiddio,

source: RoofConstruction,
cy: AdeiladwaithTo,

source: LoftSpace,
cy: LleGwagYnYTo,

source: LoftAccess,
cy: MynediadI’rAtig,

source: RoofInsulated,
cy: ToWedi’iInswleiddio,

source: GlazingType,
cy: MathFfenestri,

source: OutdoorSpace,
cy: LleTuAllan,

source: HeatingType,
cy: MathSystemWresogi,

source: OtherHeatingType,
cy: MathArallSystemWresogi,

source: HotWaterCylinder,
cy: TancDŵrPoeth,

source: NumberOfOccupants,
cy: NiferPreswylwyr,

source: HeatingPattern,
cy: PatrwmGwresogi,

source: Temperature,
cy: Tymheredd,

source: AnswerSummary,
cy: CrynodebAtebion,

source: NoRecommendations,
cy: DimArgymhellion,

source: YourRecommendations
cy: EichArgymhellion

source: AddLoftInsulation,
cy: YchwaneguDeunyddInswleiddioYnYrAtig,

source: Your energy savings advice reference code:
cy: Eich cyfeirnod ar gyfer cyngor arbed ynni:

source: Thank you for using our service and answering questions about your home and energy use.
cy: Diolch am ddefnyddio ein gwasanaeth ac am ateb cwestiynau am eich cartref a’ch defnydd o ynni.

source: Based on your answers, we have recommended some improvements that you or an accredited tradesperson could carry out to improve the energy efficiency of your home. Follow the link below to view your recommendations.
cy: Ar sail eich atebion, rydym wedi argymell rhai gwelliannau y gallech chi neu grefftwr achrededig eu gwneud i wella effeithlonrwydd ynni eich cartref. Dilynwch y ddolen isod i weld eich argymhellion.

source: If the link does not work you can copy your unique reference code below
cy: Os nad yw’r ddolen yn gweithio, gallwch gopïo eich cyfeirnod unigryw isod

source: And go to
cy: A mynd i

source: From this page, you can return to your recommendations and action plan. You will be asked to enter your reference code.
cy: O’r dudalen hon gallwch fynd yn ôl at eich argymhellion a chynllun gweithredu. Gofynnir i chi roi eich cyfeirnod.

source: Next steps
cy: Y camau nesaf

source: We hope this service has helped you decide which energy efficiency improvements you could make to help save on your energy bills.
cy: Rydym yn gobeithio bod y gwasanaeth hwn wedi eich helpu i benderfynu pa welliannau effeithlonrwydd ynni y gallech chi eu gwneud er mwyn helpu i arbed arian ar eich biliau ynni.

source: Feedback
cy: Adborth

source: If you have any feedback on our service, you can use this link to let us know https://forms.microsoft.com/r/1G63YXE4Qq
cy: Os oes gennych chi unrhyw adborth am ein gwasanaeth, gallwch ddefnyddio’r ddolen hon i roi gwybod i ni https://forms.microsoft.com/r/1G63YXE4Qq

source: Building type
cy: Math o adeilad

source: Year home was built
cy: Blwyddyn adeiladu’r eiddo
