Repository: UKGovernmentBEIS/beis-simple-energy-advice-beta
Catalog: SeaPublicWebsite/Resources/SharedResources.*.resx
Languages: cy

source: Find energy improvements suitable for your home
cy: Darganfod gwelliannau ynni sy’n addas ar gyfer eich cartref

source: tradesperson to improve the energy efficiency of your home.
cy: grefftwr eu gwneud i wella effeithlonrwydd ynni eich cartref.

source: Who can use this service
cy: Pwy all ddefnyddio’r gwasanaeth hwn

source: This service is for people who own their own property in England and Wales.
cy: Gwasanaeth yw hwn ar gyfer pobl sy’n berchen ar eu heiddo eu hunain yng Nghymru a Lloegr.

source: What you get from this service
cy: Beth rydych chi’n ei gael o’r gwasanaeth hwn

source: This service recommends the improvements most likely to be suitable for you based on information about your home and energy use. For example, you may receive advice on:
cy: Mae’r gwasanaeth hwn yn argymell y gwelliannau sydd fwyaf tebygol o fod yn addas i chi ar sail gwybodaeth am eich cartref a’ch defnydd o ynni. Er enghraifft, efallai y cewch gyngor ar y canlynol:

source: insulating your loft, walls and floor
cy: inswleiddio eich atig, waliau a lloriau

source: upgrading your heating
cy: uwchraddio eich system wresogi

source: fitting double glazing
cy: gosod ffenestri gwydr dwbl

source: installing solar panels
cy: gosod paneli solar

source: Each recommendation will explain what’s involved, how much it could cost you and how much it could save on typical energy bills. You will also receive information about where to go to for more advice.
cy: Bydd pob argymhelliad yn egluro beth mae’n ei gynnwys, faint y gallai ei gostio i chi a faint y gallai ei arbed ar filiau ynni arferol. Byddwch hefyd yn cael gwybodaeth am ble i fynd i gael rhagor o gyngor.

source: You can then build an action plan of the recommendations you would like to act on. There will be advice on where to find accredited tradespeople to do the work, and information on where to go for further support.
cy: Yna gallwch lunio cynllun gweithredu o’r argymhellion yr hoffech weithredu arnynt. Bydd cyngor am ble i ddod o hyd i grefftwyr achrededig i wneud y gwaith, a gwybodaeth am ble i fynd i gael rhagor o gymorth.

source: What you will need
cy: Beth fydd ei angen arnoch

source: You will need to answer some questions about your home and how much energy you use.
cy: Bydd angen i chi ateb ychydig o gwestiynau am eich cartref a faint o ynni rydych chi’n ei ddefnyddio.

source: How long it takes
cy: Pa mor hir mae’n ei gymryd

source: Start now
cy: Dechrau nawr

source: Other ways to get support
cy: Ffyrdd eraill o gael cymorth

source: If you would like some help with the website, you can call us to talk to one of our digital support assistants.
cy: Os hoffech chi gael cymorth â’r wefan, gallwch ein ffonio i siarad ag un o’n cynorthwywyr cymorth digidol.

source: Telephone
cy: Ffôn

source: Monday to Friday: 8am to 8pm
cy: Dydd Llun i ddydd Gwener: 8am tan 8pm

source: Saturday and Sunday: 9am to 5pm
cy: Dydd Sadwrn a dydd Sul: 9am tan 5pm

source: Find out more about call charges
cy: Rhagor o wybodaeth am gostau galwadau

source: GOV.UKFind energy improvements suitable for your home
cy: GOV.UK Darganfod gwelliannau ynni sy’n addas ar gyfer eich cartref

source: Back
cy: Yn ôl

source: Skip to main content
cy: Neidio i'r prif gynnwys

source: Have you used this service before?
cy: Ydych chi wedi defnyddio’r gwasanaeth hwn o'r blaen?

source: No, this is my first visit or I don’t have a reference code
cy: Naddo, dyma fy ymweliad cyntaf neu does gen i ddim cyfeirnod

source: Yes, and I have the 8-character reference code from my previous visit
cy: Do, ac mae gen i gyfeirnod 8 nod o’m hymweliad blaenorol

source: Your 8-character reference code
cy: Eich cyfeirnod 8 nod

source: Continue
cy: Bwrw ymlaen

source: What does this mean?
cy: Beth mae hyn yn ei olygu?

source: If you have visited the service before, you can get your recommendations with the 8-character reference code provided to you during your last visit.
cy: Os ydych chi wedi ymweld â’r gwasanaeth o’r blaen, gallwch gael gafael ar eich argymhellion gyda’r cyfeirnod 8 nod a roddwyd i chi yn ystod eich ymweliad diwethaf.

source: Example reference code
cy: Cyfeirnod enghreifftiol

source: Get help using the online service
cy: Cael cymorth i ddefnyddio'r gwasanaeth ar-lein

source: You can get phone support if you need help using the online service. This could be if you:
cy: Gallwch gael cymorth dros y ffôn os oes angen help arnoch i ddefnyddio’r gwasanaeth ar-lein. Gallai hyn fod yn berthnasol i chi os:

source: do not feel confident using a computer or mobile device
cy: nad ydych chi’n teimlo’n hyderus wrth ddefnyddio cyfrifiadur neu ddyfais symudol

source: do not have internet access
cy: nad oes gennych chi fynediad i’r rhyngrwyd

source: Find Ways to Save Energy in Your Home
cy: Dod o hyd i ffyrdd o arbed ynni yn eich cartref

source: Telephone (free phone service): 0800 098 7950
cy: Ffôn (gwasanaeth ffôn rhad ac am ddim): 0800 098 7950

source: Monday to Friday, 8am to 6pm
cy: Dydd Llun i ddydd Gwener, 8am i 6pm

source: Saturday, 9am to 12pm
cy: Dydd Sadwrn, 9am i 12pm

source: Sunday and Bank Holidays, Closed
cy: Dydd Sul a Gwyliau Banc, Ar gau

source: Find out about call charges
cy: Gwybodaeth am gostau galwadau

source: Support links
cy: Dolenni cymorth

source: All content is available under the Open Government Licence v3.0, except where otherwise stated
cy: Mae’r holl gynnwys ar gael dan Drwydded Llywodraeth Agored v3.0 ac eithrio pan nodir fel arall

source: © Crown copyright
cy: © Hawlfraint y Goron

source: Which country is your property located in?
cy: Ym mha wlad mae eich eiddo?

source: Why do we need to know this?
cy: Pam fod arnom angen cael gwybod hyn?

source: This service is only available for those who live in England and Wales.
cy: Dim ond i bobl sy’n byw yng Nghymru a Lloegr y mae’r gwasanaeth hwn ar gael.

source: England
cy: Lloegr

source: Wales
cy: Cymru

source: Scotland
cy: Yr Alban

source: Northern Ireland
cy: Gogledd Iwerddon

source: A country not listed here
cy: Gwlad sydd heb ei rhestru yma

source: Sorry, this service isn't for you
cy: Yn anffodus dydy’r gwasanaeth hwn ddim ar eich cyfer chi

source: This service only provides advice for people who own their own home in England and Wales.
cy: Dim ond i bobl sy’n berchen ar eu cartrefi eu hunain yng Nghymru a Lloegr y mae’r gwasanaeth hwn yn rhoi cyngor.

source: Other services that might be helpful to you
cy: Gwasanaethau eraill a allai fod o gymorth i chi

source: Do you own your property?
cy: Ydych chi'n berchen ar eich eiddo?

source: Why do we need to know this
cy: Pam fod arnom angen cael gwybod hyn

source: This service only provides advice to people who own their home.
cy: Dim ond i bobl sy’n berchen ar eu cartrefi y mae’r gwasanaeth hwn yn rhoi cyngor.

source: Yes, I own my property and live in it
cy: Ydw, rwy’n berchen ar fy eiddo ac yn byw ynddo

source: No, I am a tenant
cy: Na, rwy’n denant

source: I am the property owner but lease my property to one or more tenants
cy: Fi ydy perchennog yr eiddo ond rwy’n prydlesu’r eiddo i un neu fwy o denantiaid

source: You may be able to get help from your Energy Performance Certificate (EPC)
cy: Efallai y gallwch gael help gan o’ch Tystysgrif Perfformiad Ynni (EPC)

source: An Energy Performance Certificate contains information about a property and how energy efficient it was when the certificate was made.
cy: Mae Tystysgrif Perfformiad Ynni yn cynnwys gwybodaeth am eiddo a’i effeithlonrwydd ynni adeg dyfarnu’r dystysgrif.

source: We will use the information on your certificate to help you to answer our questions.
cy: Byddwn yn defnyddio’r wybodaeth ar eich tystysgrif i’ch helpu i ateb ein cwestiynau.

source: The information from the certificate can be used as a guide. You may select your preferred response to any question.
cy: Gellir defnyddio’r wybodaeth ar y dystysgrif fel canllaw. Gallwch ddewis yr ateb sydd orau gennych i unrhyw gwestiwn.

source: You will need to provide your property’s address to find out if has a current certificate.
cy: Bydd angen i chi roi cyfeiriad eich eiddo i gael gwybod a oes ganddo dystysgrif gyfredol.

source: Would you like to see if your property has a registered Energy Performance Certificate?
cy: Ydych chi eisiau gweld a oes gan eich eiddo Dystysgrif Perfformiad Ynni gofrestredig?

source: If your property does not have an Energy Performance Certificate, please choose ‘No’.
cy: Os nad oes gan eich eiddo Dystysgrif Perfformiad Ynni, dewiswch ‘Nac oes’.

source: Yes
cy: Oes

source: No
cy: Nac oes

source: Find your EPC
cy: Dod o hyd i’ch Tystysgrif Perfformiad Ynni

source: What is the address of your property?
cy: Beth yw cyfeiriad eich eiddo?

source: What we do with your address
cy: Beth rydym yn ei wneud gyda’ch cyfeiriad

source: Building number or name
cy: Rhif neu enw'r adeilad

source: e.g. 19 or Buckingham Palace
cy: e.e. 19 neu Palas Buckingham

source: Postcode
cy: Cod post

source: e.g. AB12 3CD
cy: e.e. AB12 3CD

source: Cancel and continue without an EPC
cy: Canslo a bwrw ymlaen heb EPC

source: We weren't able to find a complete Energy Performance Certificate for your property
cy: Doedd dim modd i ni ddod o hyd i Dystysgrif Perfformiad Ynni gyflawn ar gyfer eich eiddo

source: This could be because there isn't a complete Energy Performance Certificate for your property, your property is a new build or because your address is saved in a different format.
cy: Gallai hyn fod oherwydd nad oes Tystysgrif Perfformiad Ynni gyflawn ar gyfer eich eiddo, am fod eich eiddo yn adeilad newydd, neu am fod eich cyfeiriad wedi’i gadw mewn fformat gwahanol.

source: You can continue without the Energy Performance Certificate. We will need to ask you some questions to work out which home improvements are most likely to be suitable for your home. There will be guidance to support you along the way.
cy: Gallwch fwrw ymlaen heb y Dystysgrif Perfformiad Ynni. Bydd angen i ni ofyn ychydig o gwestiynau i chi er mwyn gweld pa welliannau sydd fwyaf tebygol o fod yn addas ar gyfer eich cartref. Bydd arweiniad i’ch helpu ar hyd y daith.

source: We found an Energy Performance Certificate that might be yours
cy: Rydym wedi dod o hyd i Dystysgrif Perfformiad Ynni a allai fod yn eich un chi

source: This certificate may be registered to your property or one of the properties nearby that shares part of your address.
cy: Efallai bod y dystysgrif hon wedi'i chofrestru i’ch eiddo neu eiddo cyfagos sy'n rhannu rhan o'ch cyfeiriad.

source: Certificate
cy: Tystysgrif

source: Registered address
cy: Cyfeiriad cofrestredig

source: Is this your address?
cy: Ai eich cyfeiriad chi yw hwn?

source: We found multiple Energy Performance Certificates that might be yours
cy: Rydym wedi dod o hyd i fwy nag un Dystysgrif Perfformiad Ynni a allai fod yn eich un chi

source: One of these certificates may be registered to your property or to the properties nearby that share part of your address.
cy: Efallai bod un o’r tystysgrifau hyn wedi'i chofrestru i’ch eiddo neu eiddo cyfagos sy'n rhannu rhan o'ch cyfeiriad.

source: Your address may not be listed here if it does not have a registered certificate.
cy: Efallai na fydd eich cyfeiriad wedi’i restru yma os nad oes ganddo dystysgrif gofrestredig.

source: Choose your address
cy: Dewiswch eich cyfeiriad

source: Please choose your address if it is listed, otherwise choose ‘My address is not listed here’
cy: Dewiswch eich cyfeiriad os yw wedi’i restru, neu dewiswch ‘Nid yw fy nghyfeiriad wedi’i restru yma’

source: You can still continue to use this service as there are further questions that can help determine the kind of measures you can take.
cy: Gallwch barhau i ddefnyddio’r gwasanaeth hwn gan fod rhagor o gwestiynau a all helpu i bennu’r math o gamau y gallwch chi eu cymryd.

source: Confirm your EPC details
cy: Cadarnhau manylion eich Tystysgrif Perfformiad Ynni

source: Check your property's details
cy: Gwirio manylion eich eiddo

source: Please confirm that this information about your property is correct. This information cannot be changed later once you continue.
cy: Cadarnhewch fod yr wybodaeth am eich eiddo yn gywir. Ni fydd modd newid yr wybodaeth hon ar ôl i chi fwrw ymlaen.

source: Is this information correct?
cy: Ydy’r wybodaeth hon yn gywir?

source: What kind of property do you have?
cy: Pa fath o eiddo sydd gennych chi?

source: Energy use varies between different buildings, particularly for heating.
cy: Mae defnydd ynni yn amrywio rhwng gwahanol adeiladau, yn enwedig o ran gwresogi.

source: Some home improvements are only possible or appropriate for certain buildings.
cy: Dim ond ar gyfer rhai adeiladau y mae rhai gwelliannau i’r cartref yn bosibl neu’n briodol.

source: House
cy: Tŷ

source: Bungalow
cy: Byngalo

source: Apartment, flat or maisonette
cy: Rhandy, fflat neu fflat deulawr

source: What kind of house do you have?
cy: Pa fath o dŷ sydd gennych chi?

source: Detached
cy: Tŷ sengl

source: Does not share any of its walls with another house or building
cy: Nid yw’n rhannu unrhyw un o’i waliau â th? neu adeilad arall

source: Semi-detached
cy: Tŷ pâr

source: Is attached to one other house or building
cy: Mae’n sownd yn un tŷ neu adeilad arall

source: Terraced
cy: Tŷ Teras

source: Sits in the middle with a house or building on each side
cy: Mae’n eistedd yn y canol gyda thŷ neu adeilad o boptu

source: End terrace
cy: Pen teras

source: Sits at the end of a row of similar houses with one house attached to it
cy: Mae’n eistedd ar ben rhes o dai tebyg gydag un tŷ yn sownd ynddo

source: What kind of bungalow do you have?
cy: Pa fath o fyngalo sydd gennych chi?

source: What kind of flat do you have?
cy: Pa fath o fflat sydd gennych chi?

source: Top floor
cy: Llawr uchaf

source: Sits directly below the roof with no other flat above it
cy: Mae’n eistedd yn union o dan y to heb fflat arall uwch ei ben

source: Middle floor
cy: Llawr canol

source: Has another flat above, and another below
cy: Mae ganddo fflat arall uwch ei ben, ac un arall oddi tanodd

source: Ground floor
cy: Llawr gwaelod

source: The lowest flat in the building with no flat beneath - typically at street level but may be a basement
cy: Y fflat isaf yn yr adeilad heb fflat oddi tanodd - fel arfer ar lefel y stryd ond gallai fod yn fflat islawr

source: Roughly what year was your property built?
cy: Oddeutu pa flwyddyn y cafodd eich eiddo ei adeiladu?

source: If you are unsure, choose 'I don't know'. We will take a best guess based on other information you provide.
cy: Os nad ydych chi’n siŵr, dewiswch ‘Ddim yn gwybod’. Byddwn yn gwneud y dyfaliad gorau ar sail yr wybodaeth arall rydych chi’n ei rhoi.

source: Help me answer this question
cy: Helpwch fi i ateb y cwestiwn hwn

source: You may find information about the age of the property in title deeds or other paperwork you received when you bought your home, or home insurance paperwork.
cy: Efallai y byddwch yn gallu dod o hyd i wybodaeth am oed yr eiddo mewn gweithredoedd neu waith papur arall a gawsoch wrth brynu eich cartref, neu yng ngwaith papur eich yswiriant cartref.

source: If your property is a conversion, enter the year the building was originally built, regardless of what the building was used for before it was your home.
cy: Os yw eich eiddo'n addasiad, nodwch y flwyddyn y cafodd yr adeilad ei godi'n wreiddiol, ni waeth ar gyfer beth y defnyddiwyd yr adeilad cyn iddo fod yn gartref i chi.

source: If your property has been extended, enter the year of the oldest part of the building.
cy: Os yw eich eiddo wedi cael ei ymestyn, nodwch flwyddyn rhan hynaf yr adeilad.

source: Before 1930
cy: Cyn 1930

source: 1930 to 1966
cy: 1930 i 1966

source: 1967 to 1982
cy: 1967 i 1982

source: 1983 to 1995
cy: 1983 i 1995

source: 1996 to 2011
cy: 1996 i 2011

source: 2012 or newer
cy: 2012 neu ar ôl hynny

source: I don't know
cy: Ddim yn gwybod

source: Check your answers before continuing
cy: Gwiriwch eich atebion cyn bwrw ymlaen

source: Your responses to these questions cannot be changed beyond this point without starting again. Please check they are correct before continuing.
cy: Nid oes modd newid eich atebion i’r cwestiynau hyn yn nes ymlaen heb ddechrau eto. Gwnewch yn siŵr eu bod yn gywir cyn bwrw ymlaen.

source: Middle floor apartment, flat or maisonette
cy: Rhandy, fflat neu fflat deulawr ar y llawr canol

source: Change
cy: Newid

source: I don't know
cy: Ddim yn gwybod

source: Ground floor apartment, flat or maisonette
cy: Rhandy, fflat neu fflat deulawr ar y llawr gwaelod

source: Top floor apartment, flat or maisonette
cy: Rhandy, fflat neu fflat deulawr ar y llawr uchaf

source: Detached bungalow
cy: Byngalo sengl

source: Semi-detached bungalow
cy: Byngalo pâr

source: Terraced bungalow
cy: Byngalo teras

source: End terrace bungalow
cy: Byngalo pen teras

source: Detached house
cy: Tŷ sengl

source: Semi-detached house
cy: Tŷ pâr

source: Terraced house type
cy: Math tŷ teras

source: End terrace house
cy: Tŷ pen teras

source: What kind of walls does your property have?
cy: Pa fath o waliau sydd gan eich eiddo?

source: Solid walls may be made from brick or stone. If your home was built before 1930, it’s likely to have solid walls.
cy: Gall waliau solet fod o frics neu gerrig. Os cafodd eich cartref ei adeiladu cyn 1930, mae’n debygol mai waliau solet sydd ganddo.

source: Most homes built after 1930 have cavity walls. Cavity walls have a gap, or cavity, between the wall outside and wall inside.
cy: Waliau ceudod sydd yn y rhan fwyaf o gartrefi a adeiladwyd ar ôl 1930. Mae gan waliau ceudod fwlch, neu geudod, rhwng y wal allanol a’r wal fewnol.

source: You may have both types. For example, you have a pre-1930 home with an extension built later than 1930.
cy: Efallai bod gennych chi’r ddau fath. Er enghraifft, mae gennych chi gartref cyn-1930 gydag estyniad a gafodd ei adeiladu ar ôl 1930.

source: Help me choose which wall type I have
cy: Helpwch fi i ddewis pa fath o wal sydd gen i

source: Solid brick walls will have an alternating pattern, with some bricks laid across the wall so you can see the smaller ends from the outside.
cy: Bydd gan waliau brics solet batrwm bob yn ail, gyda rhai brics wedi’u gosod ar draws y wal fel eich bod yn gallu gweld y pennau llai o’r tu allan.

source: If your home has cavity walls, the bricks typically have an even pattern with all bricks laid lengthways.
cy: Os oes gan eich cartref waliau ceudod, fel arfer bydd gan y brics batrwm cyfartal gyda phob un o’r brics wedi’u gosod ar eu hyd.

source: If the brickwork has been covered, you may be able to tell by measuring the width of the wall. Measure the depth of the wall by a window or door on one of your external walls.
cy: Os yw’r gwaith brics wedi’i orchuddio, efallai y byddwch yn gallu dweud drwy fesur lled y wal. Mesurwch ddyfnder y wal ger ffenestr neu ddrws ar un o’ch waliau allanol.

source: If a brick wall is more than 260mm thick, then it is probably a cavity wall.
cy: Os yw trwch y wal frics yn fwy na 260mm, yna mae’n debyg mai wal geudod ydyw.

source: A narrower wall is probably a solid wall. Stone walls may be thicker still but are usually solid.
cy: Mae’n debyg bod wal gulach yn un solet. Gall waliau cerrig fod yn fwy trwchus na hynny ond fel arfer maent yn solet.

source: Solid walls
cy: Waliau solet

source: Cavity walls
cy: Waliau ceudod

source: Mix of solid and cavity walls
cy: Cymysgedd o waliau solet a waliau ceudod

source: I don’t see my option listed
cy: Dydw i ddim yn gweld fy opsiwn ar y rhestr

source: Other wall types could include cob walls, timber framed, system built, steel framed or other non-traditional build types
cy: Gallai mathau eraill o waliau gynnwys waliau clom, ffrâm bren, system barod, ffrâm ddur neu fathau eraill anhraddodiadol

source: Are your solid walls insulated?
cy: Ydy eich waliau solet wedi’u hinsiwleiddio?

source: Solid wall insulation may be installed internally, inside your home, or externally, on the outside walls.
cy: Mae modd gosod deunydd inswleiddio waliau solet yn fewnol, y tu mewn i’ch cartref, neu’n allanol, ar y waliau allanol.

source: Solid walls are more common in pre-1930 buildings and these were typically built without insulation.
cy: Mae waliau solet yn fwy cyffredin mewn adeiladau cyn-1930 ac roedd y rhain fel arfer yn cael eu hadeiladu heb ddeunydd inswleiddio.

source: If you have solid walls, it’s unlikely they are insulated.
cy: Os oes gennych chi waliau solet, mae’n annhebygol eu bod wedi’u hinswleiddio.

source: Yes, they are all insulated
cy: Ydy, maen nhw i gyd wedi’u hinswleiddio

source: Some are insulated and some are not
cy: Mae rhai ohonynt wedi’u hinswleiddio a dydy rhai ddim

source: No, they are not insulated
cy: Na, dydyn nhw ddim wedi’u hinswleiddio

source: Are your cavity walls insulated?
cy: Ydy eich waliau ceudod wedi’u hinswleiddio?

source: Cavity walls built before 1991 are typically uninsulated, unless you or someone before you had insulation installed.
cy: Fel arfer dydy waliau ceudod a adeiladwyd cyn 1991 ddim wedi’u hinswleiddio, oni bai eich bod chi, neu rywun cyn chi, wedi’u hinswleiddio.

source: Cavity walls built after 1991 were typically built with insulating material between the outer and inner walls.
cy: Roedd waliau ceudod a adeiladwyd ar ôl 1991 fel arfer yn cynnwys deunydd inswleiddio rhwng y waliau mewnol ac allanol.

source: Many cavity walls can be insulated by injecting insulation material into the cavity from the outside. A specialist company will drill holes in the outside walls, inject insulation through the holes and then seal them with cement.
cy: Mae modd inswleiddio llawer o waliau ceudod drwy chwistrellu deunydd inswleiddio i mewn i’r ceudod o’r tu allan. Bydd cwmni arbenigol yn drilio tyllau yn y waliau allanol, yn chwistrellu deunydd inswleiddio drwy’r tyllau ac yna’n eu selio â sment.

source: If there are small, filled 22 millimetre holes at regular intervals around the outside walls, it’s a sign they may have been insulated.
cy: Os oes tyllau bach 22 milimetr wedi’u llenwi i’w gweld bob hyn a hyn yn y waliau allanol, mae’n arwydd eu bod o bosibl wedi cael eu hinswleiddio.

source: Some are insulated and some not
cy: Mae rhai ohonynt wedi’u hinswleiddio a dydy rhai ddim

source: How is your ground floor built?
cy: Sut adeiladwyd eich llawr gwaelod?

source: Many homes have a ground floor made of solid concrete.
cy: Gyda choncrid solet yr adeiladwyd llawr gwaelod llawer o gartrefi.

source: Older homes are more likely to have suspended timber floors. If you have air bricks or ventilation bricks on the outside wall of your house that are below floor level, you probably have a suspended timber floor.
cy: Mae cartrefi hŷn yn fwy tebygol o gael lloriau pren crog. Os oes gennych chi frics aer neu frics awyru ar wal allanol eich tŷ sy’n is na lefel y llawr, mae’n debygol mai llawr pren crog sydd gennych.

source: You may have both types, for example, if there’s a modern extension to a pre-1950 property.
cy: Efallai fod gennych y ddau fath, er enghraifft, os oes estyniad modern ar eiddo cyn-1950.

source: If you don’t have access to the space underneath your house, you will need to lift a corner of the carpet and underlay to have a look.
cy: Os nad oes modd mynd i’r gofod o dan eich tŷ, bydd angen i chi godi cornel o’r carped a’r isgarped i gael golwg.

source: Suspended timber
cy: Pren crog

source: Solid concrete
cy: Concrid solet

source: A mix of both
cy: Cymysgedd o’r ddau

source: Other ground floor construction types include suspended concrete, flagstones or non-traditional build types.
cy: Mae mathau eraill o loriau gwaelod yn cynnwys concrid crog, cerrig llorio neu fathau anhraddodiadol.

source: Is your ground floor insulated?
cy: Ydy eich llawr gwaelod wedi'i inswleiddio?
