Repository: UKGovernmentBEIS/beis-simple-energy-advice-beta
Catalog: SeaPublicWebsite/Resources/SharedResources.*.resx
Languages: cy

source: Properties built before 1996 typically have uninsulated floors, unless you or a previous owner has installed floor insulation.
cy: Fel arfer dydy lloriau mewn eiddo a adeiladwyd cyn 1996 ddim wedi’u hinswleiddio, oni bai eich bod chi neu berchennog blaenorol wedi ychwanegu deunydd inswleiddio.

source: A solid floor may be insulated by laying insulation on top or underneath a new floor. If you’ve had to replace the ground floor, it’s likely insulated in order to comply with Building Regulations.
cy: Mae modd inswleiddio llawr solet drwy osod deunydd inswleiddio ar ben neu o dan lawr newydd. Os oedd yn rhaid i chi adnewyddu’r llawr gwaelod, mae’n debygol ei fod wedi’i inswleiddio i gydymffurfio â’r Rheoliadau Adeiladu.

source: Suspended timber floors were rarely built with insulation, so this would need to have been installed after.
cy: Anaml iawn y byddai lloriau pren crog yn cael eu hinswleiddio, felly byddai angen iddo fod wedi’i osod ar ôl hynny.

source: Yes, my floor is insulated
cy: Ydy, mae fy llawr wedi’i inswleiddio

source: No, my floor is not insulated
cy: Na, dydy fy llawr ddim wedi’i inswleiddio

source: Is any part of your roof flat?
cy: Oes unrhyw ran o’ch to yn fflat?

source: Most roofs are pitched, meaning they are built at an angle or with a slope.
cy: Mae’r rhan fwyaf o doeau ar oleddf, sy’n golygu eu bod wedi’u hadeiladu ar ongl neu ar lethr.

source: A flat roof is completely, or almost, level, with no obvious slope or angle.
cy: Mae to fflat yn hollol wastad, neu bron yn wastad, heb lethr nac ongl amlwg.

source: Yes, I only have a flat roof or roofs
cy: Oes, dim ond to neu doeon fflat sydd gen i

source: Yes, some of my roof is flat and some of my roof is pitched
cy: Oes, mae rhywfaint o’r to yn fflat a rhywfaint o’r to ar oleddf

source: No, I only have a pitched roof or roofs
cy: Nag oes, dim ond to neu doeon ar oleddf sydd gen i

source: Help me decide if I have a loft
cy: Helpwch fi i benderfynu a oes gennyf atig

source: A loft is an unheated space without walls and ceilings, immediately beneath the pitched roof. You will usually be able to see the roof timbers.
cy: Mae atig yn ofod heb ei wresogi ac nid oes ganddo waliau na nenfydau - mae’n union o dan y to ar oleddf. Byddwch fel arfer yn gallu gweld y trawstiau.

source: If all the space under your pitched roof, or nearly all the space, is used as living space with finished walls and ceilings then the loft has been converted into a room.
cy: Os yw’r gofod i gyd dan eich to ar oleddf, neu'r rhan fwyaf o’r gofod hwnnw, yn cael ei ddefnyddio fel lle byw gyda waliau a nenfydau gorffenedig, yna mae’r atig wedi’i droi’n ystafell.

source: Yes, I have a loft that hasn't been converted into a room
cy: Oes, mae gennyf atig sydd heb ei droi’n ystafell

source: No, I don’t have a loft or my loft has been converted into a room
cy: Na, does gennyf i ddim atig neu mae fy atig wedi'i droi’n ystafell

source: Is there access to your loft?
cy: A oes modd mynd i’ch atig?

source: You may have a loft hatch, access ladder or stairs that could allow an insulation installer to get into the loft space.
cy: Efallai fod gennych ddrws i’r atig, ysgol neu risiau mynediad a allai ganiatáu i'r sawl sy'n gosod y deunydd inswleiddio fynd i mewn i’r atig.

source: Yes, there is access to my loft
cy: Oes, mae modd mynd i’m hatig

source: No, there is no access to my loft
cy: Na, does dim modd mynd i’m hatig

source: Is your loft fully insulated?
cy: Ydy eich atig wedi'i inswleiddio yn llwyr?

source: If your home was built after 2002, or you have installed loft insulation since 2002, it is likely that it is fully insulated.
cy: Os cafodd eich cartref ei adeiladu ar ôl 2002, neu os ydych chi wedi inswleiddio’r atig ers 2002, mae’n debygol ei fod wedi’i inswleiddio’n llwyr.

source: Your 2013 Energy Performance Certificate suggests your loft is fully insulated as it has at least 200mm of insulation.
cy: Mae eich Tystysgrif Perfformiad Ynni 2013 yn awgrymu bod eich atig wedi’i inswleiddio’n llwyr a bod gennych o leiaf 200mm o ddeunydd inswleiddio.

source: Your 2013 Energy Performance Certificate suggests your loft is not fully insulated as it has less than 200mm of insulation.
cy: Mae eich Tystysgrif Perfformiad Ynni 2013 yn awgrymu nad ydy eich atig wedi’i inswleiddio’n llwyr a bod gennych lai na 200mm o ddeunydd inswleiddio.

source: Yes, there is at least 200mm of insulation in my loft
cy: Ydy, mae o leiaf 200mm o ddeunydd inswleiddio yn fy atig

source: No, there is less than 200mm of insulation in my loft
cy: Nac ydy, mae llai na 200mm o ddeunydd inswleiddio yn fy atig

source: Are any of your windows single glazed?
cy: A oes unrhyw un o’ch ffenestri yn rhai gwydr sengl?

source: A single glazed window has a single pane of glass.
cy: Un cwarel gwydr sydd mewn ffenestr gwydr sengl.

source: A double glazed window has two panes of glass, separated by air or gas, to make up a single window. A triple glazed window has three panes of glass.
cy: Mae dau gwarel gwydr mewn ffenestr gwydr dwbl, wedi'u gwahanu ag aer neu nwy, i greu un ffenestr. Mae tri cwarel gwydr mewn ffenestr gwydr triphlyg.

source: Secondary glazing is when an additional independent window is fitted inside, behind the main window. This is commonly used in conservation areas to improve the energy efficiency of the window without replacing it.
cy: Gwydr eilaidd yw pan fydd ffenestr annibynnol ychwanegol yn cael ei gosod y tu mewn, y tu ôl i’r brif ffenestr. Gwneir hyn yn aml mewn ardaloedd cadwraeth i wella effeithlonrwydd ynni’r ffenestr heb ei newid.

source: Yes, all the windows are single glazed
cy: Oes, mae pob un o’r ffenestri yn rhai gwydr sengl

source: Yes, at least one window is single glazed
cy: Oes, mae o leiaf un o’r ffenestri yn un gwydr sengl

source: No, all my windows are double, triple or secondary glazed
cy: Nag oes, mae pob un o’m ffenestri yn rhai gwydr dwbl, triphlyg neu eilaidd

source: Do you have anywhere outside your home where you could fit a heat pump?
cy: Oes gennych chi unrhyw le y tu allan i’ch cartref lle gallech chi osod pwmp gwres?

source: Most heat pump systems will need some outside space that you own where you could fit an external unit, about as big as a medium-sized chest of drawers.
cy: Bydd y rhan fwyaf o systemau pwmp gwres angen rhywfaint o le y tu allan lle gallech ffitio uned allanol sydd tua’r un maint â chist ddillad o faint canolig.

source: If you have a garden or own some land next to your home that would be accessible to an installer, then you may have enough outside space for a heat pump.
cy: Os oes gennych chi ardd neu os ydych chi’n berchen ar dir wrth ymyl eich cartref a fyddai’n hygyrch i osodwr, yna efallai fod gennych chi ddigon o le y tu allan ar gyfer pwmp gwres.

source: If you don’t have a garden or don’t own any land next to your home, then you may not have anywhere that could fit the external unit of a heat pump.
cy: Os nad oes gennych chi ardd neu os nad ydych chi’n berchen ar dir wrth ymyl eich cartref, efallai na fydd gennych unrhyw le i osod uned allanol y pwmp gwres.

source: What is a heat pump?
cy: Beth yw pwmp gwres?

source: A heat pump is a heating technology transferring heat from outside to heat your rooms and hot water.
cy: Pwmp gwres yw technoleg gwresogi sy’n trosglwyddo gwres o’r tu allan i wresogi eich ystafelloedd a’ch dŵr poeth.

source: The most common type in the UK are air-to-water heat pumps, meaning they transfer heat energy in the air to water that is sent to your radiators or underfloor heating, as well as a hot water cylinder for providing hot water.
cy: Y math mwyaf cyffredin yn y DU yw pympiau gwres aer-i-ddŵr, sy’n golygu eu bod yn trosglwyddo ynni gwres yn yr aer i ddŵr sy’n cael ei anfon i’ch rheiddiaduron neu system wresogi dan y llawr, yn ogystal â thanc dŵr poeth ar gyfer darparu dŵr poeth.

source: Homes of your type typically have some outdoor space that could fit a heat pump.
cy: Fel arfer mae gan gartrefi o’ch math chi rywfaint o le y tu allan lle gellir gosod pwmp gwres.

source: Homes of your type typically do not have any outdoor space that could fit a heat pump.
cy: Fel arfer does gan gartrefi o’ch math chi ddim lle y tu allan lle gellir gosod pwmp gwres.

source: What is your main heating system?
cy: Beth yw eich prif system wresogi?

source: Most people in England and Wales heat their home with a gas boiler.
cy: Mae’r rhan fwyaf o bobl yng Nghymru a Lloegr yn gwresogi eu cartrefi â boeler nwy.

source: People who have an oil or liquified petroleum gas (LPG) boiler will order fuel in advance.
cy: Bydd pobl sydd â boeler olew neu nwy petrolewm hylifedig (LPG) yn archebu tanwydd ymlaen llaw.

source: Storage heaters convert electricity to heat and provide that heat the next day.
cy: Mae gwresogyddion stôr yn trosi trydan yn wres ac yn darparu’r gwres hwnnw y diwrnod canlynol.

source: Direct acting electric heating refers to all electric radiators or plug-in heaters that use electricity at the same time as they emit heat.
cy: Mae gwres trydan uniongyrchol yn cyfeirio at bob gwresogydd trydan neu wresogydd plygio i mewn sy’n defnyddio trydan ar yr un pryd ag y maent yn rhyddhau gwres.

source: A heat pump transfers heat energy from the outdoor environment inside, either through a warm-air system or through radiators or underfloor heating
cy: Mae pwmp gwres yn trosglwyddo ynni gwres o’r amgylchedd tu allan i’r tu mewn, naill ai drwy system gwresogi aer cynnes neu drwy reiddiaduron neu system wresogi dan y llawr

source: If you have more than one heating type, select the system that you use more often, or that is able to heat the whole home. For example, select ‘Oil boiler’ if you have an oil boiler and wood burning stove.
cy: Os oes gennych chi fwy nag un math o ddull gwresogi, dewiswch y system rydych chi’n ei defnyddio amlaf, neu sy’n gallu gwresogi’r cartref cyfan. Er enghraifft, dewiswch 'Bwyler olew' os oes gennych chi foeler olew a stôf llosgi coed.

source: Gas boiler
cy: Boeler nwy

source: Oil boiler
cy: Boeler olew

source: LPG boiler
cy: Boeler LPG

source: You have an LPG boiler if you order gas deliveries to a tank in your garden
cy: Mae gennych chi foeler LPG os ydych chi’n archebu nwy i danc yn eich gardd

source: Storage heaters
cy: Gwresogyddion stôr

source: Direct acting electric heating
cy: Gwres trydan uniongyrchol

source: This could include electric fires, fan heaters or electric radiators
cy: Gallai hyn gynnwys tanau trydan, gwresogyddion ffan neu reiddiaduron trydan

source: Heat pump
cy: Pwmp gwres

source: Other
cy: Arall

source: Do you have a hot water cylinder?
cy: Oes gennych chi danc dŵr poeth?

source: If you have a combi boiler, you will not have a hot water cylinder.
cy: Os oes gennych foeler cyfun, ni fydd gennych danc dŵr poeth.

source: If you’re not sure what a hot water cylinder is, we’ve provided some guidance on this page that could help.
cy: Os nad ydych chi’n siŵr beth yw tanc dŵr poeth, rydym wedi cynnwys canllawiau ar y dudalen hon a allai helpu.

source: Yes, I have a hot water cylinder
cy: Oes, mae gen i danc dŵr poeth

source: No, I do not have a hot water cylinder
cy: Nag oes, does gen i ddim tanc dŵr poeth

source: Most homes in England and Wales do not have a hot water cylinder.
cy: Does gan y rhan fwyaf o gartrefi yng Nghymru a Lloegr ddim tanc dŵr poeth.

source: What is a hot water cylinder?
cy: Beth yw tanc dŵr poeth?

source: A hot water cylinder, or hot water tank, stores hot water and is separate from your boiler.
cy: Mae tanc, neu silindr, dŵr poeth yn storio dŵr poeth ac mae ar wahân i’ch boeler.

source: If you have a warm tank in an airing cupboard or loft space, it’s likely this is your hot water cylinder.
cy: Os oes tanc cynnes mewn cwpwrdd crasu neu ofod atig mae'n debygol mai hwn yw eich tanc dŵr poeth.

source: Image above is of a typical domestic hot water cylinder. It is a large round cylinder with pipes attached at multiple places. It is separate from the boiler.
cy: Mae’r llun uchod yn dangos tanc dŵr poeth domestig nodweddiadol. Mae’n silindr crwn mawr gyda phibellau’n sownd mewn sawl lle. Mae ar wahân i’r boeler.

source: Biomass boiler
cy: Boeler biomas

source: A biomass boiler burns wood logs, chips or pellets and provides your whole home with heating
cy: Mae boeler biomas yn llosgi logiau, naddion neu beledi coed ac yn cynhesu’r cartref cyfan

source: Coal or solid fuel heating
cy: Gwres glo neu danwydd solet

source: You have coal or solid fuel heating if you burn coal or other solid fuels in a fireplace or stove
cy: Mae gennych wres glo neu danwydd solet os ydych chi’n llosgi glo neu danwydd solet arall mewn lle tân neu stôf

source: How many people live in your home?
cy: Sawl person sy’n byw yn eich cartref?

source: Count all adults and any children normally resident in your home.
cy: Cyfrwch bob oedolyn ac unrhyw blant sy'n byw yn eich cartref fel arfer.

source: Why do we want to know this?
cy: Pam fod arnom eisiau cael gwybod hyn?

source: This information allows us to estimate how much energy your household uses.
cy: Mae’r wybodaeth hon yn ein galluogi i amcangyfrif faint o ynni mae eich cartref yn ei ddefnyddio.

source: e.g. 3
cy: e.e. 3

source: Skip this question
cy: Anwybyddu’r cwestiwn hwn

source: In winter, how do you typically heat your home?
cy: Sut ydych chi’n gwresogi eich cartref fel arfer dros y gaeaf?

source: We know heating use can vary throughout the year and from one day to the next.
cy: Rydym yn gwybod bod y defnydd o wres yn gallu amrywio drwy gydol y flwyddyn ac o un diwrnod i’r llall.

source: Choose an answer that best resembles an average weekday in winter, or let us know a specific number of hours.
cy: Dewiswch yr ateb sy’n cyfateb orau i ddiwrnod arferol o’r wythnos yn y gaeaf, neu nodwch nifer penodol o oriau.

source: You may have your heating on through the day but switch it off before you go to sleep at night.
cy: Efallai y bydd eich gwres ymlaen yn ystod y dydd ond eich bod yn ei ddiffodd cyn mynd i gysgu gyda’r nos.

source: Some people may run their heating all night, or for a few hours overnight.
cy: Efallai y bydd rhai pobl yn rhedeg eu system wresogi drwy’r nos, neu am ychydig o oriau dros nos.

source: All day and all night
cy: Drwy’r dydd a thrwy’r nos

source: All day and off at night
cy: Drwy’r dydd a’i ddiffodd gyda’r nos

source: I'd like to input my hours
cy: Hoffwn nodi’r nifer o oriau

source: Total whole number of hours in the morning (12am until 12pm)
cy: Cyfanswm nifer yr oriau yn y bore (12am tan 12pm)

source: e.g. 6
cy: e.e. 6

source: Total whole number of hours in the afternoon and evening (12pm until 12am)
cy: Cyfanswm nifer yr oriau yn y prynhawn a gyda’r nos (12pm tan 12am)

source: What temperature do you heat your home to?
cy: I ba dymheredd ydych chi’n gwresogi eich cartref?

source: If you have a room thermostat, this will be the temperature that is usually set to.
cy: Os oes gennych chi thermostat ystafell, hwn fydd y tymheredd a osodir ar hwnnw fel arfer.

source: Enter the temperature you heat your home to in degrees Celcius (°C).
cy: Nodwch i ba dymheredd rydych chi’n gwresogi eich cartref mewn gradd Celsius (°C).

source: e.g. 20
cy: e.e. 20

source: What temperature should I heat my home to?
cy: I ba dymheredd ddylwn i wresogi fy nghartref?

source: Age UK suggest the elderly heat their main living areas to 21 degrees, while heating the rest of their home to at least 18 degrees.
cy: Mae Age UK yn awgrymu bod yr henoed yn gwresogi eu prif fannau byw i 21 gradd, ac yn gwresogi gweddill eu cartref i 18 gradd o leiaf.

source: Check your answers
cy: Gwiriwch eich atebion

source: Please review the information we have gathered. You can still change your answers if anything looks wrong.
cy: Ailedrychwch ar yr wybodaeth rydym wedi’i chasglu. Gallwch newid eich atebion os ydy unrhyw beth yn edrych yn anghywir.

source: See results
cy: Gweler y canlyniadau

source: Question skipped
cy: Wedi anwybyddu’r cwestiwn

source: Do you have a loft that hasn't been converted into a room?
cy: Oes gennych chi atig sydd heb ei droi’n ystafell?

source: Glazing type
cy: Math o ffenestri

source: Outdoor space for heat pump
cy: Lle y tu allan ar gyfer pwmp gwres

source: Size of household
cy: Maint yr aelwyd

source: Heating pattern
cy: Patrwm gwresogi

source: Temperature
cy: Tymheredd

source: A mix of both suspended timber and solid concrete
cy: Cymysgedd o loriau pren crog a choncrid solet

source: Important
cy: Pwysig

source: Your saved recommendations will be reset if you change any of your answers
cy: Bydd eich argymhellion sydd wedi’u cadw’n cael eu hailosod os byddwch yn newid unrhyw un o’ch atebion

source: You may be able to make some improvements to your home
cy: Efallai y byddwch yn gallu gwneud rhywfaint o welliannau i’ch cartref

source: Based on the information you’ve given us, there may be some changes a qualified installer could make to your home to reduce the amount of energy it needs to use.
cy: Ar sail yr wybodaeth rydych chi wedi’i rhoi i ni, efallai y bydd rhai newidiadau y gallai gosodwr cymwys eu gwneud i’ch cartref i leihau faint o ynni y mae angen iddo ei ddefnyddio.

source: We’ve found 6 recommended improvements for you to consider.
cy: Rydym wedi dod o hyd i 6 o welliannau i chi eu hystyried.

source: We will advise you if your home needs to meet certain conditions for a given improvement to be effective for you.
cy: Byddwn yn eich cynghori os oes angen i’ch cartref fodloni rhai amodau penodol i’r gwelliant fod yn effeithiol i chi.

source: If you like any of these recommendations, you can save them to your action plan before you move on.
cy: Os ydych chi’n hoffi unrhyw un o’r argymhellion hyn, gallwch eu cadw yn eich cynllun gweithredu cyn bwrw ymlaen.

source: Getting back to your recommendations once you leave
cy: Mynd yn ôl at eich argymhellion ar ôl i chi adael

source: You will need a reference code to return to your recommendations and action plan quickly if you leave the service.
cy: Bydd angen cyfeirnod arnoch i fynd yn ôl at eich argymhellion a’ch cynllun gweithredu yn gyflym os ydych cyn gadael y gwasanaeth.

source: Your reference code
cy: Eich cyfeirnod

source: Would you like us to email the above?
cy: Hoffech chi gael e-bost â’r manylion uchod?

source: We will send you a link to your recommendations and your reference code so you can quickly get back when you need to. If you do not wish to provide an email, make sure you make a note of your reference code.
cy: Byddwn yn anfon dolen i’ch argymhellion atoch ynghyd â’ch cyfeirnod fel bod modd i chi ddod yn ôl yn gyflym pan fydd angen. Os nad ydych yn dymuno rhoi e-bost, gwnewch yn siŵr eich bod yn gwneud nodyn o’ch cyfeirnod.

source: Yes, email a link and the reference code to me
cy: Hoffwn, e-bostiwch ddolen a’r cyfeirnod ataf

source: Explore recommendations
cy: Archwilio argymhellion

source: 1 recommended improvement
cy: 1 gwelliant a argymhellir

source: Your home is energy efficient
cy: Mae eich cartref yn defnyddio ynni’n effeithlon

source: Your home is well insulated
cy: Mae eich cartref wedi’i inswleiddio’n dda

source: From the information collected, it seems like your home is already energy efficient and may not significantly benefit from further measures.
cy: O’r wybodaeth a gasglwyd, mae’n ymddangos bod eich cartref eisoes yn defnyddio ynni’n effeithlon ac mae’n bosibl na fyddai’n elwa’n sylweddol ar ragor o fesurau.

source: You may be able to make changes to how you use energy to help reduce your bills.
cy: Efallai y gallwch newid y ffordd rydych chi’n defnyddio ynni er mwyn helpu i leihau eich biliau.

source: What else you can do
cy: Beth arall allwch chi ei wneud

source: If you’d like to do more to improve the energy efficiency of your home, consider the following:
cy: Os hoffech chi wneud mwy i wella effeithlonrwydd ynni eich cartref, beth am ystyried y canlynol:

source: Install a heat pump –
cy: Gosod pwmp gwres –

source: Check if your home may be suitable
cy: Edrychwch a ydy eich cartref yn addas

source: When buying new appliances, upgrade to an energy efficient one -
cy: Pan fyddwch yn prynu offer newydd, beth am uwchraddio i un sy'n defnyddio ynni'n effeithlon -

source: Learn about energy labels
cy: Rhagor o wybodaeth am labeli ynni

source: Still need help?
cy: Angen mwy o help?

source: Returning to this service
cy: Dod yn ôl at y gwasanaeth hwn

source: You can come back to this page using your reference number or we can send a link to your email.
cy: Gallwch ddod yn ôl i’r dudalen hon drwy ddefnyddio eich cyfeirnod neu gallwn anfon dolen i’ch e-bost.

source: Start over
cy: Dechrau eto

source: See if there are improvements you can make to another property.
cy: Gweld a oes gwelliannau y gallwch chi eu gwneud i eiddo arall.

source: Start again for another property
cy: Dechrau eto ar gyfer eiddo arall

source: Give feedback
cy: Rhoi adborth

source: This service is still in its early stages and under active development
cy: Mae’n ddyddiau cynnar o hyd ar y gwasanaeth hwn ac mae’n dal i gael ei ddatblygu

source: Your feedback can help us to shape how the service develops so that it can best serve the needs of the public.
cy: Gall eich adborth ein helpu i ddatblygu’r gwasanaeth er mwyn diwallu anghenion y cyhoedd yn y ffordd orau.

source: Leave some feedback for this service (opens in new tab)
cy: Gadael adborth ar gyfer y gwasanaeth hwn (yn agor mewn tab newydd)

source: Download Recommendations
cy: Llwytho Argymhellion i Lawr

source: Your action plan
cy: Eich cynllun gweithredu

source: You haven’t saved any improvements yet.
cy: Dydych chi ddim wedi cadw unrhyw welliannau eto.

source: You have saved 1 recommended improvement.
cy: Rydych chi wedi cadw 1 gwelliant a argymhellir.

source: You will be able to review your action plan once you have seen all the available recommendations.
cy: Byddwch yn gallu adolygu eich cynllun gweithredu ar ôl gweld pob un o’r argymhellion sydd ar gael.

source: Add some more loft insulation
cy: Ychwanegu mwy o ddeunydd inswleiddio atig

source: Based on the information we have collected; it looks like you have some insulation in your loft but it’s less than the recommended amount. It could be worthwhile adding some more to bring it up to the recommended thickness of 300mm, or 12 inches.
cy: Ar sail yr wybodaeth rydym wedi'i chasglu; mae'n ymddangos bod gennych rywfaint o ddeunydd inswleiddio yn eich atig ond ei fod yn llai na'r hyn a argymhellir. Gallai fod yn werth ychwanegu mwy i’w godi i’r trwch a argymhellir o 300mm, neu 12 modfedd.

source: Adding extra insulation can help trap the heat inside your property so your heating doesn’t need to be on as much.
cy: Gall ychwanegu deunydd inswleiddio ychwanegol helpu i ddal gwres y tu mewn i’ch eiddo fel nad oes angen rhoi’ch gwres ymlaen gymaint.

source: If some of your loft is boarded so that you can store things up there you will either need to raise this boarding up and insulate underneath it, or leave that part of the loft with thinner insulation.
cy: Os oes estyll mewn rhan o'ch atig er mwyn storio pethau yno, bydd angen i chi naill ai godi'r estyll hyn i fyny ac inswleiddio oddi tanodd, neu adael y rhan honno o'r atig â deunydd inswleiddio teneuach.

source: Who this improvement is suitable for
cy: Ar gyfer pwy mae’r gwelliant hwn yn addas

source: You should consider this improvement for your property if:
cy: Dylech ystyried y gwelliant hwn ar gyfer eich eiddo:

source: You have a pitched (sloping) roof with an unheated loft space that someone could easily get into.
cy: Os oes gennych chi do ar oleddf (llethr) gydag atig heb ei wresogi y gallai rhywun fynd iddo’n ddidrafferth.
