Repository: UKGovernmentBEIS/beis-simple-energy-advice-beta
Catalog: SeaPublicWebsite/Resources/SharedResources.*.resx
Languages: cy

source: Your loft has less than the recommended amount of insulation. This is 300mm or 12 inches thick.
cy: Os oes llai o ddeunydd inswleiddio nag yr argymhellir yn eich atig. Hynny yw, trwch o 300mm neu 12 modfedd.

source: What you could save
cy: Faint allech chi ei arbed

source: This could save up to
cy: Gallai hyn arbed hyd at

source: Which adds up to
cy: Sy’n cyfateb i

source: This could cost
cy: Gallai hyn gostio

source: Would you consider this improvement for your property?
cy: A fyddech chi’n ystyried y gwelliant hwn ar gyfer eich eiddo?

source: Yes, save this recommendation to my action plan
cy: Byddwn, cadw’r argymhelliad hwn yn fy nghynllun gweithredu

source: Maybe, but I’d like more information
cy: Efallai, ond hoffwn gael rhagor o wybodaeth

source: No, discard this recommendation
cy: Na fyddwn, anwybyddu’r argymhelliad hwn

source: Continue to
cy: Parhau i

source: Recommendation 2
cy: Argymhelliad 2

source: Upgrade your heating controls
cy: Uwchraddio eich rheolaethau gwresogi

source: If you have a central heating system then it’s important you can control it effectively, so that you can stay warm without wasting energy.
cy: Os oes gennych chi system gwres canolog, mae’n bwysig bod modd ei rheoli’n effeithiol er mwyn i chi allu cadw’n gynnes heb wastraffu ynni.

source: The standard way to do that is to have a central programmer and thermostat to manage when the heating is on and how much, as well as thermostatic radiator valves (TRVs) to control the heating in each room.
cy: Y ffordd safonol o wneud hynny yw cael rhaglennydd canolog a thermostat i reoli pryd mae’r gwres ymlaen ac am ba mor hir, yn ogystal â falfiau thermostatig rheiddiadur (TRVs) i reoli’r gwres ym mhob ystafell.

source: Alternatively, you may want to choose a smart heating controller to make it easier to adjust the settings.
cy: Fel arall, efallai y byddwch yn dymuno dewis rheolydd gwres clyfar i’w gwneud yn haws addasu’r gosodiadau.

source: You will need a competent installer to fit new controls to your heating system.
cy: Bydd angen gosodwr cymwys arnoch i osod rheolaethau newydd ar eich system wresogi.

source: You have a central heating system with radiators and you do not already have a full set of controls.
cy: Os oes gennych chi system gwres canolog gyda rheiddiaduron ac nid oes gennych set lawn o reolaethau yn barod.

source: Fit new windows
cy: Gosod ffenestri newydd

source: Based on the information we have collected; it looks like you have some single glazed windows in your home. Double or triple glazed windows are much better at keeping the heat in, so would help you keep warm while reducing your heating bills.
cy: Ar sail yr wybodaeth rydym wedi'i chasglu; mae'n ymddangos bod gennych rywfaint o ffenestri gwydr sengl yn eich cartref. Mae ffenestri gwydr dwbl neu driphlyg yn llawer gwell am gadw'r gwres i mewn, ac felly yn eich helpu i gadw'n gynnes yn ogystal â lleihau eich biliau gwresogi.

source: The fuel bill savings from replacing windows are unlikely to pay back the full installation cost, but there are other benefits such as reduced maintenance and better sound proofing that may affect your decision.
cy: Mae’n annhebygol y bydd yr arbedion mewn biliau tanwydd a welir wrth newid ffenestri yn ad-dalu’r gost gosod lawn, ond mae manteision eraill fel llai o waith cynnal a chadw a gwrthsain gwell a allai effeithio ar eich penderfyniad.

source: If you live in a conservation area or listed building there may be limits on what changes you can make to your windows. You should check with your local authority to see what is allowed.
cy: Os ydych chi'n byw mewn ardal gadwraeth neu adeilad rhestredig, efallai y bydd cyfyngiadau ar y newidiadau y gallwch chi eu gwneud i'ch ffenestri. Dylech chi holi eich awdurdod lleol i weld beth maen nhw’n ei ganiatáu.

source: You have any single glazed windows.
cy: Oes gennych chi unrhyw ffenestri gwydr sengl.

source: Insulate your cavity walls
cy: Inswleiddio eich waliau ceudod

source: From the information we have it looks like the outside walls of your home are cavity walls, and that the cavity has not been insulated.
cy: O’r wybodaeth sydd gennym, mae’n ymddangos bod waliau allanol eich cartref yn waliau ceudod, ac nad ydynt wedi’u hinswleiddio.

source: Specialist contractors can inject insulation into the cavity, reducing heat loss significantly and helping to cut your bills.
cy: Gall contractwyr arbenigol chwistrellu deunydd inswleiddio i mewn i’r ceudod, gan leihau faint o wres sy’n cael ei golli’n sylweddol a’ch helpu i leihau eich biliau.

source: Your property was built with uninsulated cavity walls - this was common between the 1920s and the 1980s.
cy: Os adeiladwyd eich eiddo gyda waliau ceudod heb eu hinswleiddio - roedd hyn yn gyffredin rhwng yr 1920au a’r 1980au.

source: The cavity has not been insulated since.
cy: Os nad yw’r ceudod wedi’i inswleiddio ers hynny.

source: Not all buildings are suitable for standard cavity wall insulation. You will need a specialist contractor to inspect your property to work out what insulation options you have.
cy: Nid yw pob adeilad yn addas ar gyfer deunydd inswleiddio waliau ceudod safonol. Bydd angen contractwr arbenigol arnoch i archwilio eich eiddo i weld pa opsiynau inswleiddio sy’n agored i chi.

source: Insulate your solid walls
cy: Inswleiddio eich waliau solet

source: Solid wall insulation can be fitted internally (internal wall insulation) or externally (external wall insulation).
cy: Mae modd gosod deunydd inswleiddio waliau solet yn fewnol (inswleiddio waliau mewnol) neu’n allanol (inswleiddio waliau allanol).

source: Internal wall insulation will slightly reduce the size of any rooms that have an external wall, and you will need to redecorate afterwards.
cy: Bydd inswleiddio waliau mewnol yn lleihau ychydig ar faint unrhyw ystafelloedd sydd â wal allanol, a bydd angen i chi ailaddurno wedyn.

source: You can find more information on solid wall insulation on the Energy Saving Trust website.(opens in a new window)
cy: Gallwch ddod o hyd i ragor o wybodaeth am ddeunydd inswleiddio waliau solet ar wefan yr Ymddiriedolaeth Arbed Ynni.(yn agor mewn ffenestr newydd)

source: You have solid brick or stone walls with no cavity (this is common for homes built before 1920).
cy: Os oes gennych waliau solet o frics neu gerrig heb geudod (mae hyn yn gyffredin mewn cartrefi a adeiladwyd cyn 1920).

source: Your home is a non-standard construction such as steel frame, timber frame or concrete.
cy: Adeiladwaith ansafonol fel ffrâm ddur, ffrâm bren neu goncrid sydd yn eich cartref.

source: You will need a specialist contractor to assess what the best way is to insulate your walls, and to carry out the work. This is not a DIY job, or one for a general builder.
cy: Bydd angen contractwr arbenigol arnoch i asesu’r ffordd orau o inswleiddio eich waliau, ac i ymgymryd â’r gwaith. Dydy hon ddim yn dasg DIY nac yn dasg i adeiladwr cyffredinol.

source: Install a heat pump
cy: Gosod pwmp gwres

source: A heat pump is a low carbon heating system and is much more efficient than a boiler. Rather than burning a fuel like gas or oil, it uses electricity to transfer heat from outside to heat your rooms and hot water.
cy: Mae pwmp gwres yn system wresogi carbon isel ac mae’n llawer mwy effeithlon na boeler. Yn hytrach na llosgi tanwydd fel nwy neu olew, mae’n defnyddio trydan i drosglwyddo gwres o’r tu allan i wresogi eich ystafelloedd a’ch dŵr poeth.

source: You have some outdoor space
cy: Os oes gennych chi rywfaint o le y tu allan

source: You are looking to reduce your carbon footprint
cy: Os ydych chi eisiau lleihau eich ôl troed carbon

source: The running costs of heat pumps depend on a number of factors to do with your heating system and your property. Speak to a heat pump installer to find out more.
cy: Mae costau rhedeg pympiau gwres yn dibynnu ar nifer o ffactorau sy’n ymwneud â’ch system wresogi a’ch eiddo. Siaradwch â gosodwr pympiau gwres i gael gwybod mwy.

source: Fit solar electric panels
cy: Gosod paneli trydan solar

source: If you have a suitable roof area you may be able to fit solar photovoltaic panels, or solar PV, to generate electricity.
cy: Os oes gennych chi le addas ar eich to, efallai y byddwch yn gallu gosod paneli ffotofoltäig solar, neu solar PV, i gynhyrchu trydan.

source: You have a roof area that faces somewhere south of due east or due west.
cy: Os ydy rhan o’ch to yn wynebu rhywle i’r de o gyfeiriad y dwyrain neu’r gorllewin.

source: This roof area is not often shaded by trees or other buildings.
cy: Os nad yw’r rhan hon o’r to yn cael ei chysgodi'n aml gan goed neu adeiladau eraill.

source: The savings you get from a solar PV system will depend on many factors, including whether there are people at home during the day using electricity.
cy: Bydd yr arbedion a gewch o system solar PV yn dibynnu ar nifer o ffactorau, gan gynnwys a oes pobl gartref yn ystod y dydd yn defnyddio trydan.

source: How long could this take to install? 2 DAYS
cy: Pa mor hir allai ei gymryd i’w osod? 2 DDIWRNOD

source: Insulate the ground floor
cy: Inswleiddio’r llawr gwaelod

source: From the information we have it looks like you have a suspended timber floor. This means your ground floor is made of wooden floorboards with a gap underneath.
cy: O’r wybodaeth sydd gennym mae’n ymddangos bod gennych lawr pren crog. Mae hyn yn golygu bod eich llawr gwaelod wedi’i wneud o estyll pren gyda bwlch oddi tanodd.

source: Your floor could be insulated by lifting the floorboards, fitting insulation between the joists and then putting the floorboards back. This is normally a job for a professional installer.
cy: Gallai eich llawr gael ei inswleiddio drwy godi’r estyll, gosod deunydd inswleiddio rhwng y distiau ac yna rhoi’r estyll yn ôl. Tasg i osodwr proffesiynol ydy hon fel arfer.

source: You will need to completely empty the rooms that are being insulated, and remove any carpet or other floor covering, before the floor boards can be lifted.
cy: Bydd angen i chi wagio’r ystafelloedd sy’n cael eu hinswleiddio’n gyfan gwbl a thynnu unrhyw garped neu orchudd arall sydd ar y llawr cyn y gellir codi’r estyll.

source: Your property has a suspended timber floor that has not yet been insulated. If you are unsure, a qualified installer will be able to confirm this for you.
cy: Os oes gan eich eiddo lawr pren crog sydd heb ei inswleiddio hyd yma. Os ydych chi’n ansicr, bydd gosodwr cymwys yn gallu cadarnhau hyn i chi.

source: CautionYou will need to completely empty the rooms that are being insulated, and remove any carpet or other floor covering, before the floor boards can be lifted.
cy: Rhybudd Bydd angen i chi wagio’r ystafelloedd sy’n cael eu hinswleiddio’n gyfan gwbl a thynnu unrhyw garped neu orchudd arall sydd ar y llawr cyn y gellir codi’r estyll.

source: Upgrade to high heat retention storage heaters
cy: Uwchraddio i wresogyddion stôr sy’n cadw gwres uchel

source: Based on the information we have collected; it looks like you have manual storage heaters. Consider upgrading to high heat retention storage heaters with automatic controls.
cy: Ar sail yr wybodaeth rydym wedi'i chasglu; mae'n ymddangos bod gennych wresogyddion stôr rydych chi’n eu rheoli eich hun. Ystyriwch uwchraddio i wresogyddion stôr cadw gwres uchel gyda rheolaethau awtomatig.

source: Compared to older storage heaters, modern high heat retention storage heaters:
cy: O'i gymharu â hen wresogyddion stôr, mae gwresogyddion stôr cadw gwres uchel:

source: Hold more heat
cy: Yn dal mwy o wres

source: Have better insulation
cy: Wedi’u hinswleiddio’n well

source: Release heat more quickly when needed
cy: Yn rhyddhau gwres yn fwy cyflym pan fo angen

source: Their improved controls, including automatic charge control, thermostat and programmer, allowing you to set the temperature you want the room to be heated and when, with the heater only drawing the electricity needed to meet that programme.
cy: Yn cynnwys rheolaethau gwell, gan gynnwys rheolydd gwefru, thermostat a rhaglennydd awtomatig, sy’n eich galluogi i osod i ba dymheredd rydych am wresogi’r ystafell a phryd, gyda’r gwresogydd ond yn defnyddio’r trydan sydd ei angen i gyflawni’r rhaglen honno.

source: You have older, manually controlled storage heaters
cy: Os oes gennych wresogyddion storio hŷn rydych chi’n eu rheoli eich hun

source: If you feel comfortable fitting this yourself, you can buy a British Standard jacket from most DIY shops and fit it snugly around the tank. These jackets will have heavy duty fixings and a flame retardant cover.
cy: Os ydych chi’n teimlo’n gyfforddus yn gwneud hyn eich hun, gallwch brynu siaced Safon Brydeinig o’r rhan fwyaf o siopau DIY a’i rhoi’n daclus o amgylch y tanc. Bydd gan y siacedi hyn osodiadau cryf a gorchudd gwrth-fflam.

source: You may also want to consider using foam collars around any exposed hot water pipes to save even more energy.
cy: Efallai y byddwch hefyd yn dymuno ystyried defnyddio coleri ewyn o amgylch unrhyw bibellau dŵr poeth agored i arbed mwy fyth o ynni.

source: Recommendation Suitable For
cy: Argymhelliad yn addas ar gyfer

source: You have a hot water cylinder that isn’t factory insulated or has less than 80 mm thick insulating jacket
cy: Mae gennych danc dŵr poeth sydd heb ei inswleiddio yn y ffatri neu sydd â siaced inswleiddio sy’n llai na 80mm o drwch

source: Recommendation Lifetime
cy: Oes a Argymhellir

source: You may well need to fit new or additional controls when you fit a new gas boiler to comply with building regulations. These will help to maximise the system’s efficiency, saving you even more money.
cy: Efallai y bydd angen i chi osod rheolaethau newydd neu ychwanegol pan fyddwch yn gosod boeler nwy newydd i gydymffurfio â'r rheoliadau adeiladu. Bydd y rhain yn helpu i wneud y system mor effeithlon â phosibl, gan arbed hyd yn oed mwy o arian i chi.

source: You have an old or inefficient gas boiler, or your boiler is broken
cy: Mae gennych hen foeler nwy neu foeler nwy aneffeithlon, neu mae eich boeler wedi torri

source: Alternatively, you may want to consider fitting a low carbon heating system such as a heat pump.
cy: Neu, efallai y byddwch yn dymuno ystyried gosod system wresogi carbon isel fel pwmp gwres.

source: Based on the information we have collected; it looks like you have some single glazed windows in your home. Double or triple glazed windows are much better at keeping the heat in, so would help
cy: Ar sail yr wybodaeth rydym wedi'i chasglu; mae'n ymddangos bod gennych rywfaint o ffenestri gwydr sengl yn eich cartref. Mae ffenestri gwydr dwbl neu driphlyg yn llawer gwell am gadw'r gwres i mewn, ac felly yn eich helpu

source: you keep warm while reducing your heating bills.
cy: i gadw'n gynnes yn ogystal â lleihau eich biliau gwresogi.

source: Caution
cy: Rhybudd

source: Download your Action Plan
cy: Llwytho eich Cynllun Gweithredu i lawr

source: Your Action Plan
cy: Eich Cynllun Gweithredu

source: You could save up to
cy: Gallech arbed hyd at

source: The total cost of the improvements could be
cy: Gallai cyfanswm cost y gwelliannau fod yn

source: How did we calculate these figures?
cy: Sut gwnaethom ni gyfrifo’r ffigurau hyn?

source: Heat pumps use the energy outside to heat your home and hot water
cy: Mae pympiau gwres yn defnyddio’r ynni y tu allan i wresogi eich cartref a’ch dŵr poeth

source: Next we have steps to help you action these recommendations.
cy: Nesaf, mae gennym gamau i’ch helpu i roi’r argymhellion hyn ar waith.

source: 1. Find out if you can apply for support
cy: 1. Darganfod os gallech chi wneud cais am gymorth

source: There may be schemes or grants available to help with the cost of installing energy efficiency improvements.
cy: Efallai y bydd cynlluniau neu grantiau ar gael i helpu â chost ymgymryd â gwelliannau effeithlonrwydd ynni.

source: We suggest speaking with your energy supplier, local council and chosen installer to ask if you may be eligible for any help.
cy: Rydym yn awgrymu eich bod yn siarad â’ch cyflenwr ynni, eich cyngor lleol a’r gosodwr rydych chi wedi’i ddewis i ofyn a allech chi fod yn gymwys am unrhyw gymorth.

source: Some of the types of support include:
cy: Dyma rai mathau o gymorth sydd ar gael:

source: Energy Company Obligation (ECO)
cy: Rhwymedigaeth Cwmni Ynni (ECO)

source: Sustainable Warmth (Local Authority Delivery Phase 3 and Homes Upgrade Grant Phase 1)
cy: Cynhesrwydd Cynaliadwy (Cyfnod Cyflawni 3 Awdurdod Lleol a Chyfnod Grant 1 Uwchraddio Cartrefi)

source: Boiler Upgrade Scheme
cy: Cynllun Uwchraddio Boeleri

source: 2. Consult with a qualified installer
cy: 2. Ymgynghori â gosodwr cymwys

source: We recommend consulting with a qualified installer to confirm what changes you can make to your property.
cy: Rydym yn argymell eich bod yn ymgynghori â gosodwr cymwys i gadarnhau pa newidiadau y gallwch chi eu gwneud i’ch eiddo.

source: You told us you would like some more information on one or more of the recommendations before considering them for your property:
cy: Rydych chi wedi dweud wrthym y byddech chi’n hoffi cael rhagor o wybodaeth am un neu fwy o’r argymhellion cyn eu hystyried ar gyfer eich eiddo:

source: Recommendations you discarded
cy: Argymhellion rydych chi wedi’u diystyru

source: Returning to your Action Plan
cy: Mynd yn ôl at eich Cynllun Gweithredu

source: You can come back to this action plan using your reference number or we can send a link to your email.
cy: Gallwch ddod yn ôl at y cynllun gweithredu hwn drwy ddefnyddio eich cyfeirnod neu gallwn anfon dolen i’ch e-bost.

source: Enter your email address
cy: Rhowch eich cyfeiriad e-bost

source: e.g. my.email@example.com
cy: e.e. my.email@example.com

source: Email a link to your Action Plan
cy: E-bostio dolen i’ch Cynllun Gweithredu

source: Download your information
cy: Llwytho eich gwybodaeth i lawr

source: Change your answers
cy: Newid eich atebion

source: We have provided recommendations that are most suitable for your home based on the answers you provided earlier.
cy: Rydym wedi gwneud argymhellion sydd fwyaf addas ar gyfer eich cartref ar sail yr atebion a ddarparwyd gennych yn gynharach.

source: Please note: We are not able to offer you advice with your energy bills, give legal, financial or installation advice but we can signpost you to other organisations.
cy: Sylwer: Nid ydym yn gallu cynnig cyngor i chi â’ch biliau ynni, rhoi cyngor cyfreithiol, ariannol neu ynghylch gosodiadau, ond gallwn eich cyfeirio at sefydliadau eraill.

source: This service is still in its early stages and under active development.
cy: Mae’n ddyddiau cynnar o hyd ar y gwasanaeth hwn ac mae’n dal i gael ei ddatblygu.

source: Leave some feedback for this service
cy: Gadael adborth ar gyfer y gwasanaeth hwn

source: Insulate your loft
cy: Inswleiddio eich atig

source: Insulate your hot water cylinder
cy: Inswleiddio eich tanc dŵr poeth

source: You told us that you don’t want to proceed with any of the recommendations suggested to you.
cy: Rydych chi wedi dweud wrthym nad ydych chi eisiau bwrw ymlaen ag unrhyw un o’r argymhellion a gynigiwyd i chi.

source: There are still some options for you to consider.
cy: Mae yna rai opsiynau i’w hystyried o hyd.

source: Household energy
cy: Ynni’r cartref

source: Cold Weather Payment
cy: Taliad Tywydd Oer

source: Green Deal: energy saving for your home
cy: Y Fargen Werdd: arbed ynni ar gyfer eich cartref

source: Help from your energy supplier: the Affordable Warmth Obligation
cy: Cymorth gan eich cyflenwr ynni: y Rhwymedigaeth Cynhesrwydd Fforddiadwy

source: Warm Home Discount Scheme
cy: Y Cynllun Gostyngiad Cartrefi Cynnes

source: Winter Fuel Payment
cy: Taliad Tanwydd Gaeaf

source: Related content
cy: Cynnwys cysylltiedig

source: Cookies on our service
cy: Cwcis ar ein gwasanaeth

source: Cookies are files saved on your phone, tablet or computer when you visit a website.
cy: Ffeiliau sy'n cael eu cadw ar eich ffôn, eich llechen neu'ch cyfrifiadur pan fyddwch yn defnyddio gwefan yw cwcis.

source: We use cookies to store information about how you use our service, such as the pages you visit.
cy: Rydym yn defnyddio cwcis i storio gwybodaeth am sut rydych chi’n defnyddio ein gwasanaeth, fel y tudalennau rydych chi’n ymweld â nhw.

source: Cookie settings
cy: Gosodiadau cwcis

source: We use 2 types of cookies. You can choose which cookies you're happy for us to use.
cy: Rydym yn defnyddio 2 fath o gwci. Gallwch ddewis pa gwcis rydych chi’n fodlon i ni eu defnyddio.

source: Cookies used to make our service better
cy: Rydym yn defnyddio cwcis i wneud ein gwasanaeth yn well

source: We use Google Analytics to measure how you use the service so we can improve it based on user needs. Google Analytics sets cookies that store anonymised information about:
cy: Rydym yn defnyddio Google Analytics i fesur sut rydych chi'n defnyddio'r gwasanaeth er mwyn ei wella ar sail anghenion defnyddwyr. Mae Google Analytics yn gosod cwcis sy’n storio gwybodaeth ddienw am:

source: how you got to the site
cy: sut y daethoch chi i'r safle

source: the pages you visit on the service and how long you spend on them
cy: y tudalennau rydych chi’n ymweld â nhw ar y gwasanaeth a faint o amser rydych chi’n ei dreulio arnynt

source: what you click on while you’re visiting the site
cy: yr hyn rydych yn clicio arno wrth ymweld â'r safle

source: On
cy: Gweithredol

source: Off
cy: Anweithredol

source: Strictly necessary cookies
cy: Cwcis sydd wir eu hangen

source: These essential cookies do things like:
cy: Mae'r cwcis hanfodol hyn yn gwneud pethau fel:

source: remember your progress through the service
cy: cofio eich cynnydd drwy'r gwasanaeth

source: remember notifications you’ve seen so that we don’t show them again
cy: cofio pa hysbysiadau rydych chi wedi'u gweld fel nad ydym yn eu dangos eto

source: They always need to be on.
cy: Rhaid iddynt fod yn weithredol bob amser.

source: Details about cookies on our service
cy: Manylion am gwcis ar ein gwasanaeth

source: Our service puts small files (known as ‘cookies’) onto your computer to collect information about how you browse the site. Find out more about the cookies we use, what they’re for and when they expire.
cy: Mae ein gwasanaeth yn rhoi ffeiliau bach (a elwir yn ‘gwcis’) ar eich cyfrifiadur i gasglu gwybodaeth am sut rydych chi’n pori’r wefan. Rhagor o wybodaeth am y cwcis rydym yn eu defnyddio, ar gyfer beth, a phryd maen nhw’n dod i ben.

source: Cookies that measure website usage
cy: Cwcis sy'n mesur defnydd o'r wefan

source: We do not allow Google to use or share the data about how you use this site.
cy: Dydyn ni ddim yn caniatáu i Google ddefnyddio na rhannu’r data am sut rydych chi’n defnyddio’r safle hwn.

source: Google Analytics stores information about:
cy: Mae Google Analytics yn storio gwybodaeth am:

source: the pages you visit on our service and how long you spend on them
cy: y tudalennau rydych chi’n ymweld â nhw ar ein gwasanaeth a faint o amser rydych chi’n ei dreulio arnynt

source: Google Analytics sets the following cookies:
cy: Mae Google Analytics yn gosod y cwcis canlynol:

source: Cookies message
cy: Neges cwcis

source: You may see a banner when you visit our service inviting you to accept cookies or review your settings. We’ll set cookies so that your computer knows you’ve seen it and not to show it again, and also to store your settings.
cy: Efallai y byddwch yn gweld baner pan fyddwch yn ymweld â’n gwasanaeth yn eich gwahodd i dderbyn cwcis neu adolygu eich gosodiadau. Byddwn yn gosod cwcis fel bod eich cyfrifiadur yn gwybod eich bod wedi’i weld ac i beidio â’i ddangos eto, a hefyd i storio eich gosodiadau.

source: Change your settings
cy: Newid eich gosodiadau

source: Page not found
cy: Heb ganfod y dudalen
